Repository: Lunaresk/python_telegram_do2bot
Catalog: locales/*/LC_MESSAGES/main.po
Languages: es

source: Welcome to your new Do To Bot. This bot can be controlled via inline method. So just type '`@do2bot `' in your chat and wait a moment.
es: Bienvenido a tu nuevo Do To Bot. Este bot puede ser controlado con el método en linea. Solo debes de escribir '@do2bot ' en el chat y esperar un momento.

source: Try it now
es: Prueba ahora

source: The argument is invalid. The link provided for you might be incorrect. Please ask the owner of the list for the code of his list.
es: El argumento no es valido. El link parece incorrecto. por favor pregunta de nuevo al dueño el código de la lista.

source: The list you are searching for is not existing.
es: La lista que estas buscando no existe.

source: The list you are searching is not open. Please contact the list owner.
es: La lista que estas buscando es cerrada. Por favor ponte en contacto con el dueño de la lista.

source: Please insert a name for the new list.
es: Por favor indícame el nombre de la lista.

source: I wasn't able to create a new list. I'm sorry, please try again.
es: No he podido crear una nueva lista. Lo siento, inténtalo de nuevo.

source: No list specified. Please choose one or create a list first.
es: No se ha especificado ninguna lista. Por favor elige una o crea una lista primero.

source: I wasn't able to insert every item due to restrictions in the length of the Inlinebuttons. I'm sorry.
es: No he podido insertar cada elemento por limitaciones en el tamaño. Lo siento.

source: You're not allowed to do that.
es: No tienes permitido hacer eso.

source: The message you replied to is not showing an unique item of your list. It is not clear which item I should append the subitems to.
es: El mensaje que al que respondiste no es un elemento de tu lista. No esta claro a que elemento tengo que añadir este subelemento.

source: You own no lists. There is no need for a backup.
es: No eres dueño de ninguna lista. No hay necesidad para hacer una copia de seguridad.

source: Revoked
es: Revocado

source: Left the list
es: A la izquierda de la lista

source: List removed
es: Lista eliminada

source: If you really want to close the list, press again.
es: Si realmente quieres cerrar la lista, pulsa de nuevo

source: Closed
es: Cerrada

source: List access set to {0}
es: Acceso a la lista establecido a {0}

source: Open
es: Abierto

source: List items rearranged
es: Elementos de la lista reordenados

source: Create new list
es: Crear nueva lista.
