{
  "buttonlimit": "I wasn't able to insert every item due to restrictions in the length of the Inlinebuttons. I'm sorry.",
  "open": "Open",
  "closed": "Closed",
  "confirmremove": "If you really want to close the list, press again.",
  "insertname": "Please insert a name for the new list.",
  "invalidargs": "The argument is invalid. The link provided for you might be incorrect. Please ask the owner of the list for the code of his list.",
  "leftlist": "Left the list",
  "listaccess": "List access set to {0}",
  "newlist": "Create new list",
  "notallowed": "You're not allowed to do that.",
  "notbackedup": "You own no lists. There is no need for a backup.",
  "notcreated": "I wasn't able to create a new list. I'm sorry, please try again.",
  "notexisting": "The list you are searching for is not existing.",
  "notopen": "The list you are searching is not open. Please contact the list owner.",
  "notspecified": "No list specified. Please choose one or create a list first.",
  "notunique": "The message you replied to is not showing an unique item of your list. It is not clear which item I should append the subitems to.",
  "rearrangeditems": "List items rearranged",
  "removelist": "List removed",
  "revoked": "Revoked",
  "try": "Try it now",
  "welcome": "Welcome to your new Do To Bot. This bot can be controlled via inline method. So just type '`@do2bot `' in your chat and wait a moment.",
  "help": "To create a new list, use /new. Then enter a title for this list. When you're done, you can send a list of things here and this bot will insert it to the list.\nThe lower right button on the owner's list indicates whether the list is open or not. Only the owner can switch if the list is open. When open, other people who enters the unique code of your list will be added as operator for your list. This will grant them the possibility to add items to the list and recall the list with the inline function.\n\nIf you need help with something specific, try this one out: `/help commands`\n\nThis bot is usable via inline mode. To see a list of your current lists, just type the bots name in the chat like '`@do2bot `'.",
  "helpargs": {
    "backup": "To make backups, use the /backup command. The bot then will take your stored lists and pack them in a .json file and send this one file to you. This function is also currently being developed, so there will be more functions to this soon.",
    "new": "If you want to make a new list, use the /new command or the inline function, type in what title you want and that's it.",
    "credits": "Creator: Lunaresk\nCoder: Lunaresk\nHoster: Lunaresk\nProfile Pic: Abdülkadir Coskun\n\nInspired by: @dotobot from @olebedev",
    "support": "This bot is open source and the code is available on GitHub. If you need help with anything or the GitHub link, please join @do2chat and ask the creator :3\n\nIf you want to support me, you can do so by donating a bit via the following link:\nhttps://paypal.me/pools/c/8fWVnNBFaS for one-time donations, use this link.",
    "share": "Sharing a list is made with the inline function of telegram. you can either use the middle button at the bottom of the list or type @do2bot and the name or the code of your list to find and send it.",
    "permission": "This bot uses a permission system. Per default, nobody except you can modify a list. To change this, you have to press the lower right button (👤) and the ones you want to work on the list needs to press the corresponding link of the list you shared. Please remember that as long as your list is marked as open, anyone with the link/code can join and manipulate it, so remember to close it again :)",
    "limitations": "Due to the way Telegram creates and limits inline buttons, there can't be displayed more than 23 rows of buttons. Therefore, I restricted the items per list to a maximum of 20 items.",
    "sublist": "To create a sublist, you have to insert a single item first. Then, reply to this message you just sent and the items will be inserted as subitems for the previously inserted item. Please note! Subitems are under the same restrictions as stated in '/help limitations'."
  }
}
